bench/results/java17/20260309T232257Z/load.stdout.txt
{"ok": true, "tool": "wrk", "url": "http://localhost:8080/api/gateway/orders", "duration_s": 120, "warmup_s": 60, "concurrency": 25, "threads": 4, "requests_per_sec": 6517.44, "p50": "3.46ms", "p95": "6.71ms", "p99": "7.96ms", "http_non2xx": "na", "socket_errors": {}, "raw_excerpt": "Running 2m test @ http://localhost:8080/api/gateway/orders\n  4 threads and 25 connections\n  Thread Stats   Avg      Stdev     Max   +/- Stdev\n    Latency     3.69ms    1.37ms  29.24ms   72.20%\n    Req/Sec     1.64k   152.81     1.91k    75.71%\n  Latency Distribution\n     50%    3.46ms\n     75%    4.41ms\n     90%    5.46ms\n     99%    7.96ms\n  782306 requests in 2.00m, 178.31MB read\nRequests/sec:   6517.44\nTransfer/sec:      1.49MB"}